# Titanic Analysis

#### Titanic was a British passenger liner, which sank in the North Atlantic Ocean on 15 April 1912 after striking an iceberg during her maiden voyage from Southampton, UK, to New York City. 
#### Of the estimated 2,224 passengers and crew aboard, more than 1,500 died, which made the sinking possibly one of the deadliest for a single ship up to that time.

#### The ship was equipped with 16 lifeboat davits, each of which were capable of lowering three lifeboats, for a total of 48 boats; the Titanic carried only 20 lifeboats, thoes 20 lifeboats were capable of holding 1,178 peopleâ€”which was only about half the number of passengers on board

## Titanic dataset dictionary

survival - indecates if the passenger survived or not, 0 means No, 1 means Yes

pclass - Ticket class , 1 = 1st, 2 = 2nd, 3 = 3rd

sex	- gender of the passenger

Age	- Age of the passenger in years	

sibsp - number of siblings / spouses aboard the Titanic	

parch - number of parents / children aboard the Titanic	

ticket - Ticket number	

fare - Passenger fare	

cabin - Cabin number	

embarked - Port of Embarkation

`


Step 1 : import the libraries

In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
import datetime as dt
import plotly as pt
import plotly.express as px
import matplotlib as mpg

Step 2 : import the data

In [4]:
titanic = pd.read_csv('train.csv')

Step 3 : explore the data

In [5]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Step 4 : drop the cabin columns beacuse it's mostly empty

In [17]:
titanic.drop(['Cabin','Ticket'], axis=1 , inplace = True)

check some null values in the rows

In [18]:
titanic[titanic['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,80.0,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,80.0,NaN

In [21]:
titanic.groupby('Embarked').count()

          PassengerId  Survived  Pclass  Name  Sex  Age  SibSp  Parch  Fare
Embarked
C                 168       168     168   168  168  130    168    168   168
Q                  77        77      77    77   77   28     77     77    77
S                 644       644     644   644  644  554    644    644   644

In [22]:
#fill it with the most common port
titanic["Embarked"] = titanic["Embarked"].fillna("S")

## what are the factors that played a role into making the survivors survive?

In [28]:
women = titanic.loc[titanic.Sex == 'female']["Survived"]
rate_women = sum(women)/len(women)

print("total number of women :", len(women))
print("total number of women who survived :", sum(women))
print("% of women who survived:", rate_women)

total number of women : 314
total number of women who survived : 233
% of women who survived: 0.7420382165605095

In [29]:
men = titanic.loc[titanic.Sex == 'male']["Survived"]
rate_men = sum(men)/len(men)

print("total number of men :", len(men))
print("total number of men who survived :", sum(men))
print("% of men who survived:", rate_men)

total number of men : 577
total number of men who survived : 109
% of men who survived: 0.18890814558058924

so as we can see being a woman can really raise your chances to survive